maincases/drag_1000/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0.99619469 0.0871557427  0 );

boundaryField
{
    Side
    {
        type            empty;
    }

    Airfoil
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    Inlet
    {
        type            fixedValue;
        value $internalField;
    }
    Outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
